# Напишите ваше решение
int_a = int(input('Введите число а: '))
int_n = int(input('Введите степень числа n: '))

sqrt = int_a ** int_n
print(sqrt)